html/lc-2568-minimum-impossible-or.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>LC 2568. 最小无法得到的或值</title>
<meta name="author" content="dirtysalt" />
<meta name="generator" content="Org Mode" />
<link rel="shortcut icon" href="/themes/favicon.ico" /><link rel="stylesheet" type="text/css" href="/themes/simple.css"/></head>
<body>
<div id="content" class="content">
<h1 class="title">LC 2568. 最小无法得到的或值</h1>
<p>
<a href="https://leetcode.cn/problems/minimum-impossible-or/">https://leetcode.cn/problems/minimum-impossible-or/</a>
</p>

<p>
这题几乎完全没有思路，我觉得 <a href="https://leetcode.cn/problems/minimum-impossible-or/solution/nao-jin-ji-zhuan-wan-pythonjavacgo-by-en-7j89/">题解</a> 说的非常透彻：
</p>
<ul class="org-ul">
<li>如果1不在里面的话，那么就是1</li>
<li>如果2不在里面的话，那么就是2</li>
<li>此时有1,2，那么肯定有3. 如果4不在里面的话，那么就是4</li>
<li>此时5,6,7,就也都有了，接着就是8</li>
</ul>

<p>
这么来说就是第一个 `1&lt;&lt;i` 的数如果不出现的其中的话，那么就是它了。
</p>

<p>
然后题解里面还给了一个更牛的办法，就是只考虑 `1&lt;&lt;i` 的数，然后取最低位没有使用的bit `x &amp; ~x`
</p>

<div class="org-src-container">
<pre class="src src-Python">class Solution:
    def minImpossibleOR(self, nums: List[int]) -&gt; int:
        mask = 0
        for x in nums:
            if (x &amp; (x - 1)) == 0:  # x 是 2 的幂次
                mask |= x
        mask = ~mask # 没有使用的bit
        return mask &amp; -mask  # lowbit
</pre>
</div>
</div>
</body>
</html>
